{
    "сценарии": [
        {
            "название": "1: Определие жанра",
            "диалоги": [
                {
                    "вопрос": "Ричард: Эй, новенький, я Ричард Уиллем, старый волк в этом деле. Приготовься, у нас тут три убийства, все по одной схеме. Серийный маньяк, если ты не в курсе. И что интересно, двадцать лет назад тут уже была подобная история. Так вот, у тебя два варианта как ты можешь быть полезней: отправляйся в цокольный этаж и найди мне в архиве дело Браунлудского душителя, серийный номер: 125869, или же пойдешь со мной к криминалистам. Предупреждаю, вид не из приятных. Ну что выберешь? Для меня будет лучше, если ты пойдешь в архив вместо того, чтобы таскаться за мной как собачонка.",
                    "варианты_ответов": ["Искать в архиве дело Браунлудского душителя.", "Идти к криминалистам.", "Архив", "Криминалисты"],
                    "правильный_ответ": ["Искать в архиве дело Браунлудского душителя.", "Архив"],
                    "следующий_сценарий": "2.1: Архив"
                },
                {
                    "вопрос": "Эй, новенький, я Ричард Уиллем, старый волк в этом деле. Приготовься, у нас тут три убийства, все по одной схеме. Серийный маньяк, если ты не в курсе. И что интересно, двадцать лет назад тут уже была подобная история. Так вот, у тебя два варианта как ты можешь быть полезней: отправляйся в цокольный этаж и найди мне в архиве дело Браунлудского душителя, серийный номер: 125869, или же пойдешь со мной к криминалистам. Предупреждаю, вид не из приятных. Ну что выберешь? Для меня будет лучше, если ты пойдешь в архив вместо того, чтобы таскаться за мной как собачонка.",
                    "варианты_ответов": ["Как долго он пропал?", "Как он выглядит?", "Где последний раз его видели?"],
                    "правильный_ответ": ["Идти к криминалистам.", "Криминалисты"],
                    "следующий_сценарий": "2.2: Криминалистика"
                }
            ]
        },
        {
            "название": "2.1: Архив",
            "диалоги": [
                {
                    "описание": "Ты пришел в мрачное и заброшенное место, наполненное полуразрушенными полками, покрытыми таинственными следами и пятнами неизвестного происхождения. Здесь царит глубокая тьма, переплетенная силуэтами старых коробок и потускневшими картотеками. Тишина пронизана зловещими звуками, словно архив хранит тайны, которые жаждут выбраться на свет.",
                    "вопрос": "Ричард: Ты отправился в архив. Расскажи мне, что ты обнаружил о деле Браунлудского душителя.", 
                    "варианты_ответов": ["Я нашел старые полицейские записи о похожих преступлениях.","В архиве много информации о других убийствах, но ничего, что помогло бы в нашем расследовании.","Я обнаружил старые фотографии мест преступлений.","Нашел копии записей психологических экспертиз по жертвам."],
                    "правильный_ответ": "Я нашел старые полицейские записи о похожих преступлениях.",
                    "следующий_сценарий": "3.1: Решение загадки оставленным Браунлудским душителем."
                }
            ]
        },
        {
            "название": "2.2: Криминалистика",
            "диалоги": [
                {
                    "описание": "Ты вошел в холодную, медицинскую лабораторию, где криминалисты усердно работают, пытаясь раскрывать тайны преступлений. За стеклянными дверями видна слабая подсветка, и звуки анализаторов заполняют комнату. Ричард ждет от тебя важной информации.",
                    "вопрос": "Ричард: Расскажи, что ты узнал у криминалистов о последних убийствах. Есть ли какая-то ключевая информация?",
                    "варианты_ответов": ["Они обнаружили следы ДНК, которые могут привести нас к подозреваемому.","Криминалисты не смогли найти значимых доказательств.","У них есть подозрение, что убийца может быть связан с местным баром.","Они нашли несколько отпечатков пальцев на месте преступления."],
                    "правильный_ответ": "Они обнаружили следы ДНК, которые могут привести нас к подозреваемому.",
                    "следующий_сценарий": "3.2: Подозреваемые"
                }
            ]
        },

        {
            "название": "3.1: Решение загадки оставленным Браунлудским душителем.",
            "диалоги": [
                {
                    "вопрос": "Ричард: Ты нашел информацию в архиве о Браунлудском душителе. Что это может нам подсказать о его методах или мотивации?",
                    "варианты_ответов": ["Мы обнаружили, что все жертвы имеют общие черты в своем прошлом.","Данные в архиве не содержат ключевых сведений о душителе.","Браунлудский душитель оставляет после себя символ, который можно проследить в истории искусства.","В архиве есть документы, указывающие на возможную жертву душителя в будущем."],
                    "правильный_ответ": " Мы обнаружили, что все жертвы имеют общие черты в своем прошлом.",
                    "следующий_сценарий": "4.1: Доказательства"
                }
            ]
        },
        {
            "название": "3.2: Подозреваемые",
            "диалоги": [
                {
                    "вопрос": "Ричард:  Криминалисты обнаружили подозрительные совпадения ДНК с записями тюремной базы данных. У них есть два подозреваемых. Первый - Майкл Смит, который был выпущен из тюрьмы. Второй - Джонсон, бывший партнер одной из жертв. Ты знаешь, что один из них может быть ключом к разгадке, но как будешь действовать?",
                    "варианты_ответов": ["Попросить о дополнительных доказательствах против обоих подозреваемых.","Не торопиться с арестом и продолжить расследование.","Начать тайное наблюдение за обоими подозреваемыми и установить скрытые камеры..","Расспросить криминалистов о деталях анализа ДНК."],
                    "правильный_ответ": "Начать тайное наблюдение за обоими подозреваемыми и установить скрытые камеры.",
                    "следующий_сценарий": "4: "
                }
            ]
        },
        {
            "название": "4.1: Доказательства",
            "диалоги": [
                {
                "вопрос": "Ричард: Кто, по-твоему мнению, может быть подозреваемым?",
                "варианты_ответов": ["Мы обнаружили некоторые сильные улики против Александра Смита, чье поведение соответствует психологическому портрету убийцы.","Мы имеем данные, указывающие на Викторию Джонсон - ее алиби под вопросом в нескольких случаях.","Хэррисон Холл был упомянут в нескольких свидетельских показаниях, и его общественное поведение совпадает с шаблоном убийцы.","Мы также не должны исключать Линдси Уэйн - у нее есть сильные связи с местами преступлений и психологические отклонения."],
                "правильный_ответ": "Мы обнаружили некоторые сильные улики против Александра Смита, чье поведение соответствует психологическому портрету убийцы.",
                "следующий_сценарий": "Поимка"
                }
            ]
        },

        {
            "название": "4.2: Раскрываем тайну",
            "диалоги": [
                {
                    "вопрос": "Ричард: На скрытых камерах было замечено, что оба подозреваемых направляются в тайное место. Что будешь делать?",
                    "варианты_ответов": ["Прервать встречу и арестовать обоих подозреваемых.","Наблюдать за встречей, чтобы собрать дополнительные доказательства.","Попытаться выяснить, о чем идет речь в их разговоре, не выдавая своего присутствия.","Позвать подкрепление для обеспечения безопасности при аресте."],
                    "правильный_ответ": "Осторожно приблизиться к входу и послушать, что происходит.",
                    "следующий_сценарий": "5: Наблюдение"
                }
            ]
        },
        {   
            "название": "5.1.2: Поимка",
            "диалоги": [
                {
                    "вопрос": "Ричард: После ужасного открытия ты осознал, что преступник – Майкл Смит. Что ты собираешься делать?",
                    "варианты_ответов": ["Немедленно вызвать полицию и предоставить им информацию о Александре Смите.","Решить самостоятельно начать расследование, чтобы поймать Александра Смита."],
                    "правильный_ответ": "Немедленно вызвать полицию и предоставить им информацию о Александре Смите.",
                    "следующий_сценарий": "Концовка 6.1.2" 
                }
            ]
        },
        {   
            "название": "5.1.1: Поимка",
            "диалоги": [
                {
                    "вопрос": "Ричард: После ужасного открытия ты осознал, что преступник – Майкл Смит. Что ты собираешься делать?",
                    "варианты_ответов": ["Немедленно вызвать полицию и предоставить им информацию о Александре Смите.","Решить самостоятельно начать расследование, чтобы поймать Александра Смита."],
                    "правильный_ответ": "Решить самостоятельно начать расследование, чтобы поймать Александра Смита.",
                    "следующий_сценарий": "Концовка: 6.1.1" 
                }
            ]
        },
        {
            "название": "5.2.1: Ужасное открытие",
            "диалоги": [
                {
                    "описание": "Ты слышишь шепот и шорохи. Войдя внутрь, ты обнаруживаешь ужасную картину – кровь, разбросанные вещи и часть тела Джонсона. Страх и ужас охватывают тебя, и ты моментально убегаешь из помещения.",
                    "вопрос": "Что ты сделаешь после этого?",
                    "варианты_ответов": ["Позвать полицию и выявить Майкла Смита маньяком, осуществившим убийства.","Сообщить своим коллегам и начать охоту на Майкла Смита.","Самостоятельно начать расследование, чтобы поймать преступника.","Покинуть место преступления и попытаться забыть обо всем."],
                    "правильный_ответ": "Позвать полицию и выявить Майкла Смита маньяком, осуществившим убийства.",
                    "следующий_сценарий": "Концовка 6.2.1"
                }
            ]
        },
        {
            "название": "5.2.1: Ужасное открытие",
            "диалоги": [
                {
                    "описание": "Ты слышишь шепот и шорохи. Войдя внутрь, ты обнаруживаешь ужасную картину – кровь, разбросанные вещи и часть тела Джонсона. Страх и ужас охватывают тебя, и ты моментально убегаешь из помещения.",
                    "вопрос": "Что ты сделаешь после этого?",
                    "варианты_ответов": ["Позвать полицию и выявить Майкла Смита маньяком, осуществившим убийства.","Сообщить своим коллегам и начать охоту на Майкла Смита.","Самостоятельно начать расследование, чтобы поймать преступника.","Покинуть место преступления и попытаться забыть обо всем."],
                    "правильный_ответ_2": "Самостоятельно начать расследование, чтобы поймать преступника.",
                    "следующий_сценарий_2": "Концовка 6.2.2"
                }
            ]
        },
        {
            "название": "Концовка 6.1.1",
            "заключение": "К сожалению, вы не смогли найти достаточно доказательств. Преступник остался на свободе."
        },
        {
            "название": "Концовка 6.1.2",
            "заключение": "Вы успешно разгадали дело и поймали преступника. Город спасен!"
        },
        {
            "название": "Концовка 6.2.1",
            "заключение": "Вы и Ричард успешно разгадали дело и поймали преступника. Город спасен! Ричард счастлив, что вы смогли завершить это дело вместе."
        },      
        {
            "название": "Концовка 6.2.2",
            "заключение": "Ричард умер пытаясь спасти вас. После этого происшествия приступник залег на дно. Его не удалось поймать."
        }
    ]
}
