CREATE TABLE Authors (
    [AuthorID] INT IDENTITY(1,1) NOT NULL PRIMARY KEY,
    [Name] NVARCHAR(255) NOT NULL,
    [Birthdate] DATE,
    [Biography] TEXT
);

INSERT INTO Authors (Name, Birthdate, Biography) VALUES
('Джонатан Свифт', '1667-11-30', 'Ірландия жазушысы, поэті. "Гулливердің саяхаттары" атты атақты кітап авторы, сондай-ақ публицистіканы жариялап отырған еді.'),
('М. Твенн', '1835-11-30', 'Америкалық кітапхана жазушысы. "Қыз тобы жандарлары ағар" туралы сөз естімеу мүмкін болмайды.'),
('В. А. Обручев', '1853-01-07', 'Орыс жазушы. "Жер қазынасы" атындағы ұлы кітабы жария.'),
('Эрих Распен', '1898-05-08', 'Германиядан жазушы. Әлемдік литература тарихының жазушысы. Оның "Шерлок Холмс"атты кітаптары қазіргі күнде де танымал.'),
('А. Линдгрен', '1907-11-14', 'Шведияның көркем жазушысы. "Пеппа ұзын шұлық" кітаптары мен балаларға арналған басқа кітаптары арқылы танымал.'),
('Кендебай Таусоғар', '1922-12-13', 'Қазақ жазушысы, педагог. Тарихи драматургия жазып отырған. Оның "Бір малай батырларын кезінде" атындағы драмасы казақ елінде ерекше орын алады.'),
('Әлия Беркімбаева', '1936-04-20', 'Қазақ жазушысы. "Көз бұрын, саған қайтамын" романының авторы. Оның ізгі пен драматургия жазбалары танымал.'),
('Тулин Көзікоғлудың', '1938-02-09', 'Тарихи кезеңнің жазушысы. Оның "Қалыптас" атындағы жазбасы қазақ жазбасының жарық таңдауына үлкен үлесін жасаған.'),
('Баянғали Әлімжанов', '1942-11-13', 'Қазақ жазушы, философ. Оның ашық-кезекті пікірі мен педагогикалық жазбалары бізге манара жол ашады.'),
('Сәрсеков А', '1946-05-25', 'Қазақ жазушы, философ. Оның ескі жазбалары мен жаңа пікірлері мен адам қаржысы мен қазақ тілі бойынша деген кітаптары бар. Сәрсековтың жазуы - ел көрнектілігі.'),
('Кумисбайұлы Ш.', '1954-12-24', 'Балалар фольклор жазушы.'),
('Сарыбай Б.', '1961-07-11', 'Жаңа ұрпақ қазақ жазушысы. Әйгілі романдарымен ол өз жеріндегі тыныштықты, мұраттарды сипаттайды.'),
('Жұманова З.', '1965-06-01', 'Жазушы, поэт. Оның шығармашылығы релизммен әйгілі.'),
('Салықбай Ә.', '1970-11-02', 'Тарихи жазушы, героика. Әліпбайтын де болмайды, жазушы пайда болмайды деген болмау. Олардың жазбалары жарқын білім алушылардың ізгі жаңа пен басқа басып алушылардың үшін пайда болады.'),
('Оспан С.', '1980-04-18', 'Суфиялық, өмір философиясы жазушысы. Олардың жазбалары күнгі жүздең адамдарына бұл жеке пікірлерін, өмір күріп жату тәжірибесін пайдалану үшін болады.'),
('Беркімбаева Ә.', '1985-09-03', 'Жазушы, сценарист. Ол қазақ киносының дамуында жаңа танымал қарактерлер мен драматургиялық теңсіздігі мен кездесетін жаңа жоспарларды ұсынуға бағытталған.'),
('Асқар О.', '1990-12-15', 'Жазушы, сценарист. "Қалпына келтіруші" атындағы фильмінің жазбаларымен танынған. Ол өзінің ізгі жаңа мен басқа пікірлерін пайдалана отырып, бізге деп дамуын жатады.'),
('Шойбеков', NULL, 'Күрес тарихи, философиясы жазушысы. Оның тарихи өмірі жоғары дене танымал қазақ күресшісі мен жазушысы болып ашықтады. Бізге күрес тарихы мен жатандығысы бойынша ашық дене береді.'),
('Джани Родари', '1920-10-23', 'Италія писателі, казах әдебиетімен танымал өмір сүрген жазушы. Ол "Қыз тобын туралы қарапайымды кітапты ашуға себепті" атағымен танынады. Жазбалары бізге жергілікті құн ашуды, өмірді жақсартуды намыстайды.'),
('Астрид Линдгрен', '1907-11-14', 'Шведиядан көрік өмір сүрген писателі. Балалар мен кіші әсерлерге арналған романдар жазып отырған. Оның "Қыз тобы жандарлары ағар" туралы сөз етуі мүмкін болмайды, көрік жазба кезінде жариялап отырған еді.'),
('Дэвид Копперфильд. Диккенс Ч', '1812-02-07', 'Ең ізденісті писателілерден бірі. "Дэвид Копперфильд" романына кіріспе жазу өмірінде ашықтан ашық пікірлерді жіберу және оны дайындарына пайда болатын пікірлерді жіберу. Жазбалары дірілдікті талап ететін оқырманы жасайды.'),
('Хаггард Г.', '1856-06-22', 'Англиялық көрік кітапхана жазушысы. "Айдайын" кітаптар жазып отырған. Олардың өмірі жақындыктары мен кездесетін жасандары бойынша жарияланды.'),
('Несбит Э.', '1858-08-15', 'Ең ізденісті өмір сүрген жазушы. "Қазақ маузы жаратушысы" туралы білетін бірінші жылдарында басылды. Сонымен қатар, қысқа метралар мен алғашқы екі қазақ реализмінің басылмаларын жазды. Тәулікті көрік білімін ұсынады.'),
('Оралбай', NULL, 'Суфизм тарихи жазушысы. Оның "Діни басып алушылардың нығайтудың жолдары мен мүмкіндіктері" кітаптары салдары атанып жатады.');


CREATE TABLE Genres (
    [GenreID] INT IDENTITY(1,1) NOT NULL PRIMARY KEY,
    [GenreName] NVARCHAR(255) NOT NULL,
    [Description] TEXT,
    [AgeRestriction] NVARCHAR(10)
);

INSERT INTO Genres ([GenreName], [Description], [AgeRestriction]) 
VALUES 
    ('Классикалық хикаяттар', 'Белгілі авторлардың өмір, өнеге тағылымы және адами құндылықтар туралы әңгімелейтін шығармаларын қамтиды.', '6+'),
    ('Көркем әдебиет', 'Шытырман оқиға, драма, романтика және тарихи тақырыптарды қамтуы мүмкін әртүрлі романдар, әңгімелер мен қысқа әңгімелер.', '10+'),
    ('Нон-фикшен', 'Балаларға қоршаған әлемді түсінуге көмектесетін шынайы оқиғаларға, зерттеулерге және өмірбаянға негізделген кітаптар.', '12+'),
    ('Оқулықтар', 'Мектеп пәндерін, соның ішінде математика, тарих, жаратылыстану және шет тілдерін оқытуға арналған оқу материалдары.', '6+'),
    ('Поэзия', 'Метафоралар мен образдар арқылы сезімді, сезімді, дүниені қабылдауды білдіретін өлеңдер мен поэтикалық шығармалар.', '6+'),
    ('Балаларға арналған классика', 'Балалар әдебиетінің классикасына айналған шығармалар, соның ішінде Марк Твен, Льюис Кэрролл және Рудольф Штайнер сияқты авторлардың шығармалары. Бұл кітаптар әдетте қызықты әңгімелер мен дана сабақтарды ұсынады.', '8+'),
    ('Ғылыми фантастик', 'Фантастикалық элементтерді, технологиялық инновацияларды және ғаламдық шытырман оқиғаларды қамтитын, қиял мен ғылымға қызығушылықты арттыратын кітаптар.', '10+'),
    ('Мистика және қорқыныш', 'Паранормальды және мистикалық жұмбақтардың элементтерін қоса, құпия мен шиеленіс атмосферасын жасайтын кітаптар. Қорқыныш қорқынышты, құбыжықтар мен жұмбақ элементтерін қамтуы мүмкін.', '12+'),
    ('Әзіл', 'Көңілді және күлкілі сюжеттер мен кейіпкерлерді ұсынатын күлкілі тәсілмен жазылған кітаптар.', '8+'),
    ('Детектив', 'Тергеулер, жұмбақтар және басқатырғыштар — жұмбақ кітаптарда күрделі құпиялар мен қылмыстарды шешетін кейіпкерлер жиі кездеседі.', '10+');

CREATE TABLE Books (
    [BookID] [int] identity(1,1) NOT NULL PRIMARY KEY,
    [Title] [VARCHAR](255) NOT NULL,
    [Author] [int] NOT NULL,
    [Genre] [int] NOT NULL,
    [Description] TEXT,
    [Image] [VARCHAR](255),
    [Year] INT,
    [Pages] INT
);

INSERT INTO Books (Title, Author, Genre, Description, Image, Year, Pages)
VALUES 
('Гулливердің саяхаты', 1, 1, 'Гулливердің Лилипут еліне саяхаты және басқа да шытырман оқиғалар.', 'путь_к_изображению', 2023, 300),
('Том Сойердің басынан кешкендері', 2, 1, 'Миссисипидегі Том Сойер мен Хаклберри Финннің шытырман оқиғалары.', 'путь_к_изображению', 2023, 250),
('Жұмбақ жер', 3, 1, 'Жер асты үңгірлерінің фаунасын зерттеу.', 'путь_к_изображению', 2023, 280),
('Мюнхгаузеннің хикаялары', 4, 1, 'Барон Мюнхаузеннің күлкілі және керемет оқиғалары.', 'путь_к_изображению', 2023, 320),
('Ұзыншұлық Пиппи', 5, 7, 'Табиғаттан тыс күштерге ие ұзын шұлық Пиппи қыздың шытырман оқиғалары.', 'путь_к_изображению', 2023, 180),
('Қазақ халық ертегілері', 6, 7, 'Қазақтың ұлттық аңыздары мен мифтері.', 'путь_к_изображению', 2023, 200),
('Дәуіт атайдың ертегілері', 7, 7, 'Батыр Дәуіт ата туралы аңыздар мен әңгімелер.', 'путь_к_изображению', 2023, 150),
('Арман керек адамға', 8, 7, 'Өмірдің мәнін іздеу туралы әңгіме.', 'путь_к_изображению', 2023, 190),
('Өлең-Әліпп', 9, 7, 'Жұмбақ әлемдегі шытырман оқиғалар.', 'путь_к_изображению', 2023, 220),
('Алақай', 10, 7, 'Шағын қаладағы жұмбақ оқиғалар.', 'путь_к_изображению', 2023, 210),
('Бабамбай болғым келеді', 11, 7, 'Сиқыр мен қиял әлеміне саяхат.', 'путь_к_изображению', 2023, 230),
('Ақтабан', 12, 7, 'Ежелгі қаладағы жұмбақ оқиғалар.', 'путь_к_изображению', 2023, 240),
('Күлайша', 13, 7, 'Пиппи мен оның достарының шытырман оқиғалары.', 'путь_к_изображению', 2023, 260),
('Айдана мен Ақжолтай', 14, 7, 'Сүлеймен патшаның кеніші туралы аңыздар мен әңгімелер.', 'путь_к_изображению', 2023, 270),
('Қоңырау', 15, 7, '19 ғасырдағы басты кейіпкердің өмір жолы.', 'путь_к_изображению', 2023, 280),
('Дәуіт атайдың ертегілері', 16, 7, 'Теміржол әлеміне саяхат.', 'путь_к_изображению', 2023, 290),
('Ауыл балалары мен қала балалары', 17, 7, 'Темір жол бойының балалары туралы аңыздар мен әңгімелер.', 'путь_к_изображению', 2023, 300),
('Тұғрлыханның көк туы', 18, 7, 'Керемет әлемге саяхат.', 'путь_к_изображению', 2023, 310),
('Чиполлиноның басынан кешкендері', 19, 7, 'Чиполлино мен оның достарының шытырман оқиғалары.', 'путь_к_изображению', 2023, 320),
('Ұзыншұлық Пиппи Коратуттутт аралында', 20, 7, 'Ұзын шұлық Пиппидің жаңа оқиғалары.', 'путь_к_изображению', 2023, 330),
('Ұзыншұлық Пиппи достарымен бірге', 21, 7, 'Пиппи мен оның достарымен бірге туралы аңыздар мен әңгімелер.', 'путь_к_изображению', 2023, 340),
('Дэвид Копперфильд', 22, 7, '19 ғасырдағы басты кейіпкердің өмір жолы.', 'путь_к_изображению', 2023, 350),
('Сүлеймен патшаның кеніші', 23, 7, 'Шығыс ертегілері әлеміндегі шытырман оқиғалар.', 'путь_к_изображению', 2023, 360),
('Темір жол бойының балалары', 24, 7, 'Теміржол әлеміне саяхат.', 'путь_к_изображению', 2023, 370);

CREATE TABLE Users (
    [UserID] [int] identity(1,1) NOT NULL PRIMARY KEY,
    [Username] [VARCHAR](255) NOT NULL,
    [Password] [VARCHAR](255) NOT NULL,
    [Email] [VARCHAR](255) NOT NULL,
    [RegistrationDate] DATETIME NOT NULL
);

CREATE TABLE Reviews (
    [ReviewID] [int] identity(1,1) NOT NULL PRIMARY KEY,
    [UserID] [int] NOT NULL,
    [BookID] [int] NOT NULL,
    [ReviewText] TEXT NOT NULL,
    [Rating] INT NOT NULL,
    FOREIGN KEY (UserID) REFERENCES Users(UserID),
    FOREIGN KEY (BookID) REFERENCES Books(BookID)
);
